Repository: AbdurahmanAb/Habesha_Horizons
Catalog: lib/l10n/app_*.arb
Languages: am

source: Recommendation
am: ለ እርሶ

source: View All
am: ሁሉንም አሳይ

# otherPlaces
source: Other Places to Visit
am: ሌሎች መዳረሻዎች

# goodMorning
source: Good Moring Fellas!
am: መልካም ቀን

# goodEvening
source: Good Evening Fellas!
am: መልካም ምሽት

# liveCurency
source: Live Currency
am: ምንዛሬ ምልከታ

source: live Currency Exchange
am: ምንዛሬ መከታተያ

# currencyConvertor
source: Currency Convetor
am: ምንዛሬ መቀየሪያ

source: From
am: ከ

source: To
am: ወደ

# amount
source: Amout
am: መጠን

source: Convert
am: ቀይር

source: Forem
am: ሀሳብ

source: FAQ
am: ጥያቄዎች

source: Exit
am: ዝጋ

# favourite
source: Favourites
am: የተወደዱ

source: Calander
am: የጊዜ ሰሌዳ

source: Settings
am: መተግበሪያ

# travelandKnow
source: Travel And Know Ethiopia
am: ኢትዮጵያን በመጓዝ ይወቁ!

# aboutApp
source: About the App
am: ስለ መተግበሪያው

# devlopers
source: Developers
am: አበልጻጊዎች

source: Logout
am: ከመለያ ውጣ

# siginW
source: Sign In With Google
am: በ Google መለያ ግባ

source: Distance
am: ርቀት

source: Temprature
am: አየር ሁኔታ

source: Type
am: አይነት

source: Feedback
am: አስተያየቶች

source: Your Feedback
am: የእርሶ አስተያየት

# writeHere
source: Write Your Feedback Here
am: እዚህ ጋ ይጻፉ ሀሳቦን

source: Send
am: ላክ

source: About
am: ስለ
